# CannotConvertFlexPipeToPart Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..CannotConvertFlexPipeToPart Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Cannot convert flex pipe to fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConvertFlexPipeToPart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConvertFlexPipeToPart As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConvertFlexPipeToPart {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace